liucxecal202003.org
#+TITLE: 刘春秀ECAL优化报告及代码阅读笔记
#+AUTHOR: 林韬
#+LATEX_HEADER: \usepackage[UTF8]{ctex}

* 报告主要内容

- 第2页，主要内容包括BGO晶体的模拟和重建，性能研究
- 第3页，研究动机
  - 优化晶体的颗粒度
    - 粒子鉴别的性能，特别是高能 $\pi^0$ 衰变产生的 2$\gamma$
    - 区分 $\gamma$ 和 K_L，基于cluster的时间等分布
    - 重建能量泄露的可能性
  - crystal的排布
    - 单元的大小
    - 层数
    - 每层的深度
  - CEPC中ECAL的几何
    - 晶体的大小，wrapper（？）
    - 估计所有晶体的体积
    - 估计电子学通道数
    - 造价估计
- 第4页，基于GEANT4 10.5的探测器构建
  - 一个简化版本的晶体量能器模块
  - Matrix module
    - 60x60x60 cells
    - 读出单元 10mm x 10mm x 10mm
    - 探测器阵列前端到探测器中心的距离为 1835mm
  - GEANT4仅仅模拟了cell中的沉积能量
  - 10mm 的单元对于桶部 90度 部分的立体角为 0.31度
  - [ ] ？如何计算的
  - 在 r-phi 平面，大约能放 19 个 Matrix module
  - 在 z 方向，桶部量能器的一半为 2245mm，所以大概放 7 个 Matrix module

#+BEGIN_SRC python
>>> import math
>>> math.asin(300./1835.)
0.16422492996270302
>>> math.asin(300./1835.)*2
0.32844985992540604
>>> 2*math.pi / (math.asin(300./1835.)*2)
19.129815761244515
>>> 1150./60
19.166666666666668

>>> 2*2245. / 600
7.483333333333333

#+END_SRC

- 第5页，产生的模拟样本，为single particle， $\gamma$ 和 $\pi^0$
  - $\gamma$ 三个能量点 98 GeV，100 GeV，102 GeV
  - $\pi^0$ 一个能量点 30 GeV
  - 动量方向，从探测器中心飞向晶体中心。
  - [ ] 但是报告中的 30 是怎么回事？

- 第6页，每层cluster重建
  - 流程：clustering，finding seed，finding shower

- 第7页，研究了相关的性能
  - 包括高能 $\gamma$ 能量泄露时的修正、两个 $\gamma$ 和 $\pi^0$ 衰变的区分
  - ECAL 探测器的配置
    - 将3层合并，也就是每层变成3cm
    - 在每层进行cluster重建
    - 考虑探测器由不同的厚度，30cm/27cm/24cm，分别对应10层/9层/8层

- 第8页，展示了一个例子，100 GeV 的 $\gamma$ 例子在每层的分布
  - 报告中提到，如果没有任何的能量阈值限制，将会重建出很多的cluster
  - 分布给了cell大小为 1cm x 1cm 和 2cm x 2cm

- 第9页，给出每层的cluster能量和xy平面R的关系
- 第10页，如果假设hit、seed、cluster energy的阈值，小能量的cluster就会消失
  - 在后面的研究中，使用了能量重建时能量最大的cluster
- 第11页，给出了能量最大的cluster对应的能量和总能量的比值分布

- 从12页开始，研究纵向的能量泄露修正
  - [ ] 但我对于 longitudinal 没有太多的概念。和地球是一样的，连接南北极的线
  - 应该就是径向
- 第13页，产生的样本：三个能量点的 $\gamma$ 。研究时主要看能量的泄露。
- 第14页，沉积能量和每层的关系。此处每层厚度3cm
  - 两张图分别是正常的y坐标和对数的y坐标。应该是Profile图，y轴应该是沉积能量的平均值。
  - 但为什么分布是这样的呢？应该和shower有关系。
    - 猜测：刚开始时发生shower，开始簇射产生次级粒子，这些次级粒子也往横向、径向发展。
    - 当到达一定的径向位置后，shower的横向位置变大，所以沉积了更多的能量。
    - 最后逐渐减少。
    - [ ] 这部分应该之前学习过的。需要确认。
- 第15页给出修正的方法
  - 利用前10层或9层的沉积能量，拟和出随簇射深度的变化。
  - 然后将该函数在30cm或27cm至60cm的积分值作为修正量。
  - [ ] 其实我这里还没有看到到底泄露了多少能量
  - 修正函数 $\frac{dE}{dt} = E_0 b \frac{(bt)^{a-1}e^{-bt}}{\Gamma(a)}$
  - 三个参数为 $E_0$ $a$ $b$
- 第16页给出了修正前后的差值，以 102 GeV gamma 为例
- 第17页给出三个能量点的重建能量分布。
  - 三条曲线
    - 黑色表示仅用30cm厚度得出的能量？是重建能量？还是原初的能量？看图中的介绍，好像是沉积能量。
    - 蓝色表示加上额外的修正值后的分布
    - 红线表示？
  - 整体来说，经过修正后的能量得到了改进

* 代码相关内容

- 默认的探测器参数
  - 每个 tile 为 $10\textrm{mm} \times 10\textrm{mm} \times 10\textrm{mm}$
  - 每个 layer 由 $60\times60$ 的 tile 构成
  - 最终构建的 Ecal 为 60 层 layer
