liucxecal202003.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-15 周日 23:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>刘春秀ECAL优化报告及代码阅读笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="林韬" />
</head>
<body>
<div id="content">
<h1 class="title">刘春秀ECAL优化报告及代码阅读笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org986b9bf">1. 报告主要内容</a></li>
<li><a href="#org396da8e">2. 代码相关内容</a></li>
</ul>
</div>
</div>

<div id="outline-container-org986b9bf" class="outline-2">
<h2 id="org986b9bf"><span class="section-number-2">1</span> 报告主要内容</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>第2页，主要内容包括BGO晶体的模拟和重建，性能研究</li>
<li>第3页，研究动机
<ul class="org-ul">
<li>优化晶体的颗粒度
<ul class="org-ul">
<li>粒子鉴别的性能，特别是高能 \(\pi^0\) 衰变产生的 2\(\gamma\)</li>
<li>区分 \(\gamma\) 和 K<sub>L</sub>，基于cluster的时间等分布</li>
<li>重建能量泄露的可能性</li>
</ul></li>
<li>crystal的排布
<ul class="org-ul">
<li>单元的大小</li>
<li>层数</li>
<li>每层的深度</li>
</ul></li>
<li>CEPC中ECAL的几何
<ul class="org-ul">
<li>晶体的大小，wrapper（？）</li>
<li>估计所有晶体的体积</li>
<li>估计电子学通道数</li>
<li>造价估计</li>
</ul></li>
</ul></li>
<li>第4页，基于GEANT4 10.5的探测器构建
<ul class="org-ul">
<li>一个简化版本的晶体量能器模块</li>
<li>Matrix module
<ul class="org-ul">
<li>60x60x60 cells</li>
<li>读出单元 10mm x 10mm x 10mm</li>
<li>探测器阵列前端到探测器中心的距离为 1835mm</li>
</ul></li>
<li>GEANT4仅仅模拟了cell中的沉积能量</li>
<li>10mm 的单元对于桶部 90度 部分的立体角为 0.31度</li>
<li class="off"><input type='checkbox' /> ？如何计算的</li>
<li>在 r-phi 平面，大约能放 19 个 Matrix module</li>
<li>在 z 方向，桶部量能器的一半为 2245mm，所以大概放 7 个 Matrix module</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; import math
&gt;&gt;&gt; math.asin(300./1835.)
0.16422492996270302
&gt;&gt;&gt; math.asin(300./1835.)*2
0.32844985992540604
&gt;&gt;&gt; 2*math.pi / (math.asin(300./1835.)*2)
19.129815761244515
&gt;&gt;&gt; 1150./60
19.166666666666668

&gt;&gt;&gt; 2*2245. / 600
7.483333333333333

</pre>
</div>

<ul class="org-ul">
<li>第5页，产生的模拟样本，为single particle， \(\gamma\) 和 \(\pi^0\)
<ul class="org-ul">
<li>\(\gamma\) 三个能量点 98 GeV，100 GeV，102 GeV</li>
<li>\(\pi^0\) 一个能量点 30 GeV</li>
<li>动量方向，从探测器中心飞向晶体中心。</li>
<li class="off"><input type='checkbox' /> 但是报告中的 30 是怎么回事？</li>
</ul></li>

<li>第6页，每层cluster重建
<ul class="org-ul">
<li>流程：clustering，finding seed，finding shower</li>
</ul></li>

<li>第7页，研究了相关的性能
<ul class="org-ul">
<li>包括高能 \(\gamma\) 能量泄露时的修正、两个 \(\gamma\) 和 \(\pi^0\) 衰变的区分</li>
<li>ECAL 探测器的配置
<ul class="org-ul">
<li>将3层合并，也就是每层变成3cm</li>
<li>在每层进行cluster重建</li>
<li>考虑探测器由不同的厚度，30cm/27cm/24cm，分别对应10层/9层/8层</li>
</ul></li>
</ul></li>

<li>第8页，展示了一个例子，100 GeV 的 \(\gamma\) 例子在每层的分布
<ul class="org-ul">
<li>报告中提到，如果没有任何的能量阈值限制，将会重建出很多的cluster</li>
<li>分布给了cell大小为 1cm x 1cm 和 2cm x 2cm</li>
</ul></li>

<li>第9页，给出每层的cluster能量和xy平面R的关系</li>
<li>第10页，如果假设hit、seed、cluster energy的阈值，小能量的cluster就会消失
<ul class="org-ul">
<li>在后面的研究中，使用了能量重建时能量最大的cluster</li>
</ul></li>
<li>第11页，给出了能量最大的cluster对应的能量和总能量的比值分布</li>

<li>从12页开始，研究纵向的能量泄露修正
<ul class="org-ul">
<li class="off"><input type='checkbox' /> 但我对于 longitudinal 没有太多的概念。和地球是一样的，连接南北极的线</li>
<li>应该就是径向</li>
</ul></li>
<li>第13页，产生的样本：三个能量点的 \(\gamma\) 。研究时主要看能量的泄露。</li>
<li>第14页，沉积能量和每层的关系。此处每层厚度3cm
<ul class="org-ul">
<li>两张图分别是正常的y坐标和对数的y坐标。应该是Profile图，y轴应该是沉积能量的平均值。</li>
<li>但为什么分布是这样的呢？应该和shower有关系。
<ul class="org-ul">
<li>猜测：刚开始时发生shower，开始簇射产生次级粒子，这些次级粒子也往横向、径向发展。</li>
<li>当到达一定的径向位置后，shower的横向位置变大，所以沉积了更多的能量。</li>
<li>最后逐渐减少。</li>
<li class="off"><input type='checkbox' /> 这部分应该之前学习过的。需要确认。</li>
</ul></li>
</ul></li>
<li>第15页给出修正的方法
<ul class="org-ul">
<li>利用前10层或9层的沉积能量，拟和出随簇射深度的变化。</li>
<li>然后将该函数在30cm或27cm至60cm的积分值作为修正量。</li>
<li class="off"><input type='checkbox' /> 其实我这里还没有看到到底泄露了多少能量</li>
<li>修正函数 \(\frac{dE}{dt} = E_0 b \frac{(bt)^{a-1}e^{-bt}}{\Gamma(a)}\)</li>
<li>三个参数为 \(E_0\) \(a\) \(b\)</li>
</ul></li>
<li>第16页给出了修正前后的差值，以 102 GeV gamma 为例</li>
<li>第17页给出三个能量点的重建能量分布。
<ul class="org-ul">
<li>三条曲线
<ul class="org-ul">
<li>黑色表示仅用30cm厚度得出的能量？是重建能量？还是原初的能量？看图中的介绍，好像是沉积能量。</li>
<li>蓝色表示加上额外的修正值后的分布</li>
<li>红线表示？</li>
</ul></li>
<li>整体来说，经过修正后的能量得到了改进</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org396da8e" class="outline-2">
<h2 id="org396da8e"><span class="section-number-2">2</span> 代码相关内容</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>默认的探测器参数
<ul class="org-ul">
<li>每个 tile 为 \(10\textrm{mm} \times 10\textrm{mm} \times 10\textrm{mm}\)</li>
<li>每个 layer 由 \(60\times60\) 的 tile 构成</li>
<li>最终构建的 Ecal 为 60 层 layer</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 林韬</p>
<p class="date">Created: 2020-11-15 周日 23:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
